import math

x, y = map(int, input().split())
if x == y:
    print(0)
else:
    n = int(math.sqrt(y - x))   # ((1 + n)n // 2) * 2 - n == n ^ 2 이므로 (등차수열의 합)
    if n ** 2 == y - x:
        print(2 * n - 1)
    else:
        z = (y - x) - n ** 2
        if z <= n:
            print(2 * n)
        else:
            print(2 * n + 1)    # n^2을 빼고 남은 부분이 n보다 크면 1일 추가됨

# 3 4 5 6     3
# 1 1 1
#
# 3 4 5 6 7   4
#
# 1 2 1
#
# 3 4 5 6 7 8     5
# 1 2 1 1
#
# 3 4 5 6 7 8 9   6
# 1 2 2 1
#
# 3 4 5 6 7 8 9 10    7
# 1 2 2 1 1
#
# 8
# 1 2 2 2 1
#
# 9
# 1 2 3 2 1
#
# 10
# 1 2 2 2 2 1
#
# 11
# 1 2 3 2 2 1
#
# 12
# 1 2 3 3 2 1
#
#
# (1 + n)n
# 2
